Repository: FranksGHub/TeachersTimetable
Catalog: lib/l10n/app_*.arb
Languages: de

# appTitle
source: Teachers Timetable
de: Lehrer Stundenplan

source: Work plan
de: Arbeitsplan

# showTimetable
source: Open the timetable
de: Öffne den Stundenplan

# showNotes
source: Open the notes
de: Öffne die Notizen

# showWorkplan
source: Open the work plan
de: Öffne den Arbeitsplan

# notesTitle
source: Notes
de: Notizen

source: Menu
de: Menü

source: Help
de: Hilfe

source: Edit Title
de: Titel bearbeiten

source: Edit Days
de: Tage bearbeiten

source: Edit Times
de: Zeiten bearbeiten

# printPdf
source: Print timetable
de: Stundenplan Drucken

source: Print work plan
de: Arbeitsplan drucken

source: Print notes
de: Notizen drucken

# dataImported
source: Data imported successfully
de: Daten erfolgreich importiert

# failedToImportData
source: Data import failed
de: Fehler beim Daten Import

# dataExported
source: Data exported to {path}
de: Daten exportiert nach {path}

# dataExportedError
source: Failed to export data to {path}!
de: Fehler beim Daten Export nach {path}!

source: Time
de: Zeit

source: Lesson Name
de: Unterrichtsname

source: School Name
de: Schulname

source: Save
de: Speichern

source: Cancel
de: Abbrechen

source: Title
de: Titel

source: Days
de: Tage

source: Times
de: Zeiten

source: Edit Block
de: Block bearbeiten

source: Edit filenames
de: Dateinamen bearbeiten

source: Work plan filename
de: Dateiname des Arbeitsplans

source: Suggestions filename
de: Dateiname der Vorschläge

source: Notes filename
de: Dateiname der Notizen

# showNotesBeforeWorkplan
source: Always show notes before work plan
de: Zeige Notizen immer vor dem Arbeitsplan

source: Color:
de: Farbe:

source: Class Name
de: Klassenname

# schoolNameLabel
source: School Name
de: Schulname

source: Language
de: Sprache

source: Language English
de: Sprache Englisch

source: Language German
de: Sprache Deutsch

source: English
de: Englisch

source: German
de: Deutsch

# restartToApply
source: Restart the app to apply the language change.
de: Starten Sie die App neu, um die Sprachänderung anzuwenden.

source: Save Timetable Data
de: Speichern der Stundenplan Daten

# saveTimetableDataSubject
source: Timetable Data Backup
de: Stundenplan Daten Backup

source: Edit Text
de: Text bearbeiten

# addItemLeft
source: + Task
de: + Aufgabe

# addSubitemLeft
source: + Step
de: + Arbeitsschritt

# addItemRight
source: + Task
de: + Aufgabe

# addSubitemRight
source: + Step
de: + Arbeitsschritt

# copyItemToLeft
source: <= Task
de: <= Aufgabe

# copySubitemToLeft
source: <= Step
de: <= Schritt

# leftList
source: Current Tasks
de: Aktuelle Aufgaben

# rightList
source: Suggestions from the curriculum
de: Vorschläge aus dem Lehrplan

source: Show
de: Zeige

source: Hide
de: Verstecke

# leftListShort
source: left list
de: linke Liste

# rightListShort
source: right list
de: rechte Liste

# newItem
source: New Task
de: Aufgabe

# newSubitem
source: - New Step
de: - Arbeitsschritt

source: Failed to load notes data
de: Laden der Notiz Daten ist fehlgeschlagen

# failedToLoadLeftData
source: Failed to load curent task data
de: Laden der Aufgaben Daten ist fehlgeschlagen

# failedToLoadRightData
source: Failed to load suggestions data
de: Laden der Vorschläge ist fehlgeschlagen

# failedToSaveLeftData
source: Failed to save curent task data
de: Speichern der aktuellen Aufgaben ist fehlgeschlagen

# failedToSaveRightData
source: Failed to save suggestions data
de: Speichern der Vorschläge ist fehlgeschlagen

# saveNotesButton
source: Save
de: Speichern

# savedNotesData
source: The notes data saved successfully
de: Die Notiz Daten wurden gespeichert

source: Failed to save notes data
de: Speichern der Notiz Daten ist fehlgeschlagen

source: Failed to create zip file
de: Fehler beim erzeugen der ZIP-Datei

# timetableBackup
source: Backup all files into a zip file
de: Backup alle Dateien in eine ZIP-Datei

# timetableBackupImport
source: Import all files from a backup zip file
de: Importiere alle Dateien aus einer Backup ZIP-Datei

# failedToBackupInZipFile
source: Failed to export files
de: Fehler beim Backup der Dateien

# backupInZipFileOk
source: All files exported as ZIP
de: Alle Dateien wurden gesichert

# failedToImportZipFile
source: Failed to import files
de: Fehler beim Import der Dateien

# importbackupZipFileOk
source: All files imported successfully
de: Alle Dateien wurden importiert

# importAllFilesZip
source: Import all files from a backup (ZIP)
de: Importiere alle Dateien aus einem Backup (ZIP)

# exportAllFilesZip
source: Export all files as a backup (ZIP)
de: Exportiere alle Dateien als Backup (ZIP)

# noFilesToExportYet
source: No files to backup yet
de: Keine Dateien zum Backup gefunden

# fileNotFound
source: Source file not found
de: Quelldatei existiert nicht

# printingFooter
source: Created with the Teachers Timetable app at {date}
de: Erstellt mit der Teachers Timetable App am {date}

# bothListsHidden
source: Please make one list visible again (top right)!
de: Bitte eine Liste wieder sichtbar machen (oben rechts)!

# printingFailed
source: Drucken fehlgeschlagen
de: Printing failed

# printingSuccess
source: Drucken gestartet
de: Printing started
